{"input": "Context:\nOur billing portal shows an incorrect balance.\n\nQuestion:\nHow do I fix my account balance?", "output": "Please navigate to Settings > Billing and click Refresh Balance. If the issue persists, contact support.", "id": "row_b01", "tags": {"source": "support", "priority": "high"}}
{"input": "Context:\nThe export button is grayed out on the dashboard.\n\nQuestion:\nWhy can't I export my data?", "output": "The export feature requires at least 10 records. Please add more data before attempting to export.", "id": "row_b02", "tags": {"source": "support", "priority": "medium"}}
{"input": "Context:\nUser received a password reset email they did not request.\n\nQuestion:\nIs my account compromised?", "output": "Change your password immediately and enable two-factor authentication from your security settings.", "id": "row_b03", "tags": {"source": "security", "priority": "high"}}
{"input": "Context:\nThe mobile application crashes on startup after the recent update.\n\nQuestion:\nHow do I resolve the app crash issue?", "output": "Clear the application cache in your device settings, then reinstall the app from the official store.", "id": "row_b04", "tags": {"source": "support", "priority": "high"}}
{"input": "Context:\nA team member cannot access shared project files.\n\nQuestion:\nHow do I grant access to shared files?", "output": "Go to Project Settings > Members and add the team member with the appropriate role.", "id": "row_b05", "tags": {"source": "support", "priority": "medium"}}
{"input": "Context:\nThe search functionality returns no results for existing items.\n\nQuestion:\nWhy is the search feature broken?", "output": "The search index might need rebuilding. Navigate to Admin > Search and click the Reindex button.", "id": "row_b06", "tags": {"source": "support", "priority": "medium"}}
{"input": "Context:\nNotifications are not being delivered to email.\n\nQuestion:\nHow do I fix email notifications?", "output": "Check your notification preferences under Settings > Notifications. Also verify your email is not filtering our messages.", "id": "row_b07", "tags": {"source": "support", "priority": "low"}}
{"input": "Context:\nThe API rate limit is being exceeded during batch operations.\n\nQuestion:\nHow do I handle API rate limits?", "output": "Implement exponential backoff in your client code and consider using our batch endpoint for bulk operations.", "id": "row_b08", "tags": {"source": "engineering", "priority": "medium"}}
{"input": "Context:\nCustom reports display stale data from the previous day.\n\nQuestion:\nWhy are my reports showing outdated data?", "output": "Reports are cached for 24 hours. Use the refresh button or append ?nocache=1 to force a fresh query.", "id": "row_b09", "tags": {"source": "support", "priority": "low"}}
{"input": "Context:\nThe webhook endpoint is returning 500 errors intermittently.\n\nQuestion:\nHow do I debug webhook failures?", "output": "Check your webhook logs under Settings > Webhooks. Ensure your endpoint responds within 10 seconds.", "id": "row_b10", "tags": {"source": "engineering", "priority": "high"}}
{"input": "Context:\nFile uploads fail for documents larger than 5MB.\n\nQuestion:\nWhat is the file upload size limit?", "output": "The default upload limit is 5MB. Contact your admin to increase the limit up to 50MB for your organization.", "id": "row_b11", "tags": {"source": "support", "priority": "medium"}}
{"input": "Context:\nDashboard widgets are failing to load correctly.\n\nQuestion:\nHow do I repair broken dashboard widgets?", "output": "Try clearing your browser cache and turning off extensions. If the problem continues, reset your dashboard layout in Settings.", "id": "row_b12", "tags": {"source": "support", "priority": "low"}}
{"input": "Context:\nSSO login fails with a redirect loop error.\n\nQuestion:\nHow do I fix the SSO redirect loop?", "output": "Clear your browser cookies for our domain and verify your SSO provider configuration matches our documentation.", "id": "row_b13", "tags": {"source": "security", "priority": "high"}}
{"input": "Context:\nThe data import wizard stops at the mapping step.\n\nQuestion:\nWhy does data import freeze at mapping?", "output": "Ensure your CSV file uses UTF-8 encoding and has fewer than 100 columns. Re-export the file if needed.", "id": "row_b14", "tags": {"source": "support", "priority": "medium"}}
{"input": "Context:\nAutomation rules fail to trigger as expected.\n\nQuestion:\nWhy are my automation rules not firing?", "output": "Verify that rule conditions match your data precisely. Rules are case-sensitive and require exact field matches.", "id": "row_b15", "tags": {"source": "support", "priority": "medium"}}
