{"input": "Context:\nThe weather forecast shows rain for the entire week.\n\nQuestion:\nShould I reschedule the outdoor event?", "output": "Consider moving the event indoors or providing covered areas. Check the extended forecast for better options.", "id": "row_c01", "tags": {"source": "events", "priority": "medium"}}
{"input": "Context:\nThe quarterly budget review is overdue by two weeks.\n\nQuestion:\nHow do I expedite the budget approval?", "output": "Schedule an urgent meeting with the finance committee and prepare a summary of key variances.", "id": "row_c02", "tags": {"source": "finance", "priority": "high"}}
{"input": "Context:\nNew employees need onboarding materials for orientation.\n\nQuestion:\nWhat documents are required for onboarding?", "output": "Prepare the employee handbook, tax forms, benefits enrollment guide, and IT setup instructions.", "id": "row_c03", "tags": {"source": "hr", "priority": "medium"}}
{"input": "Context:\nThe warehouse inventory count does not match the system records.\n\nQuestion:\nHow do I reconcile inventory discrepancies?", "output": "Conduct a physical recount of affected items and update the system. File a discrepancy report for auditing.", "id": "row_c04", "tags": {"source": "operations", "priority": "high"}}
{"input": "Context:\nCustomers are complaining about slow delivery times.\n\nQuestion:\nHow can we improve delivery speed?", "output": "Review your logistics partners, consider regional warehousing, and optimize route planning algorithms.", "id": "row_c05", "tags": {"source": "logistics", "priority": "high"}}
{"input": "Context:\nThe marketing campaign has a lower click-through rate than expected.\n\nQuestion:\nHow do I improve email campaign performance?", "output": "A/B test subject lines, segment your audience more precisely, and send at optimal times based on engagement data.", "id": "row_c06", "tags": {"source": "marketing", "priority": "medium"}}
{"input": "Context:\nThe office printer is jamming frequently.\n\nQuestion:\nHow do I fix recurring printer jams?", "output": "Clean the paper feed rollers, use the correct paper weight, and schedule a maintenance service call.", "id": "row_c07", "tags": {"source": "facilities", "priority": "low"}}
{"input": "Context:\nThe company website has high bounce rates on the landing page.\n\nQuestion:\nHow do I reduce landing page bounce rates?", "output": "Improve page load speed, simplify the call to action, and ensure the content matches ad copy expectations.", "id": "row_c08", "tags": {"source": "marketing", "priority": "medium"}}
{"input": "Context:\nProject deadlines are being missed across multiple teams.\n\nQuestion:\nHow do I improve project timeline adherence?", "output": "Implement weekly milestone reviews, identify blockers early, and allocate buffer time for dependencies.", "id": "row_c09", "tags": {"source": "management", "priority": "high"}}
{"input": "Context:\nThe cafeteria menu needs updating for dietary restrictions.\n\nQuestion:\nHow do I accommodate diverse dietary needs?", "output": "Survey employees for dietary requirements, add labeled allergen-free options, and rotate menus weekly.", "id": "row_c10", "tags": {"source": "facilities", "priority": "low"}}
{"input": "Context:\nThe sales pipeline has stalled deals in the negotiation stage.\n\nQuestion:\nHow do I move stalled deals forward?", "output": "Offer limited-time incentives, address specific objections directly, and involve senior leadership in key accounts.", "id": "row_c11", "tags": {"source": "sales", "priority": "high"}}
{"input": "Context:\nEmployee satisfaction survey results show declining morale.\n\nQuestion:\nHow do I address low employee morale?", "output": "Hold team retrospectives, implement quick-win improvements, and increase recognition for contributions.", "id": "row_c12", "tags": {"source": "hr", "priority": "high"}}
{"input": "Context:\nThe backup generator failed during the last power outage test.\n\nQuestion:\nHow do I ensure backup power reliability?", "output": "Schedule monthly generator tests, replace aging fuel filters, and maintain a service contract with the vendor.", "id": "row_c13", "tags": {"source": "facilities", "priority": "high"}}
{"input": "Context:\nTravel expense reports are submitted late by most employees.\n\nQuestion:\nHow do I enforce timely expense reporting?", "output": "Set automated reminders, enforce submission deadlines tied to reimbursement cycles, and simplify the form.", "id": "row_c14", "tags": {"source": "finance", "priority": "medium"}}
{"input": "Context:\nThe vendor contract renewal is approaching in 30 days.\n\nQuestion:\nWhat steps should I take for contract renewal?", "output": "Review current terms and performance, gather stakeholder feedback, and negotiate improved pricing or SLAs.", "id": "row_c15", "tags": {"source": "procurement", "priority": "medium"}}
